<!-- terraform cdk action for options with hash c3d5df3e1d552cea07bb24b232f10f8e -->
### ✅ Successfully planned Terraform CDK Stack 'cloudwatch_alarm'



<details><summary>Show Plan</summary>

```shell
(node:2174) [DEP0040] DeprecationWarning: The `punycode` module is deprecated. Please use a userland alternative instead.
(Use `node --trace-deprecation ...` to show where the warning was created)
cloudwatch_alarm  Initializing the backend...
cloudwatch_alarm  Successfully configured the backend "s3"! Terraform will automatically
                  use this backend unless the backend configuration changes.
cloudwatch_alarm  Initializing modules...
cloudwatch_alarm  Downloading registry.terraform.io/terraform-aws-modules/cloudwatch/aws 5.3.1 for ec2_Maximum_alarm_CPUUtilization...
cloudwatch_alarm  - ec2_Maximum_alarm_CPUUtilization in .terraform/modules/ec2_Maximum_alarm_CPUUtilization/modules/metric-alarm
cloudwatch_alarm  Initializing provider plugins...
                  - Finding hashicorp/aws versions matching ">= 5.0.0, 5.64.0"...
cloudwatch_alarm  - Installing hashicorp/aws v5.64.0...
cloudwatch_alarm  - Installed hashicorp/aws v5.64.0 (signed by HashiCorp)
                  Terraform has created a lock file .terraform.lock.hcl to record the provider
                  selections it made above. Include this file in your version control repository
                  so that Terraform can guarantee to make the same selections by default when
                  you run "terraform init" in the future.
cloudwatch_alarm  Terraform has been successfully initialized!

                  You may now begin working with Terraform. Try running "terraform plan" to see
                  any changes that are required for your infrastructure. All Terraform commands
                  should now work.

                  If you ever set or change modules or backend configuration for Terraform,
                  rerun this command to reinitialize your working directory. If you forget, other
                  commands will detect it and remind you to do so if necessary.
cloudwatch_alarm  - Fetching hashicorp/aws 5.64.0 for linux_amd64...
cloudwatch_alarm  - Retrieved hashicorp/aws 5.64.0 for linux_amd64 (signed by HashiCorp)
                  - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
cloudwatch_alarm  Success! Terraform has validated the lock file and found no need for changes.
cloudwatch_alarm  Terraform used the selected providers to generate the following execution
                  plan. Resource actions are indicated with the following symbols:
                    + create

                  Terraform will perform the following actions:
cloudwatch_alarm  # aws_cloudformation_stack.chatbot (chatbot) will be created
                    + resource "aws_cloudformation_stack" "chatbot" {
                        + id            = (known after apply)
                        + name          = "cloudformation-chatbot"
                        + outputs       = (known after apply)
                        + parameters    = (known after apply)
                        + policy_body   = (known after apply)
                        + tags_all      = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + template_body = (known after apply)
                      }

                    # aws_iam_role.alert-to-slack (alert-to-slack) will be created
                    + resource "aws_iam_role" "alert-to-slack" {
                        + arn                   = (known after apply)
                        + assume_role_policy    = jsonencode(
                              {
                                + Statement = [
                                    + {
                                        + Action    = "sts:AssumeRole"
                                        + Effect    = "Allow"
                                        + Principal = {
                                            + Service = "chatbot.amazonaws.com"
                                          }
                                      },
                                  ]
                                + Version   = "2012-10-17"
                              }
                          )
                        + create_date           = (known after apply)
                        + force_detach_policies = false
                        + id                    = (known after apply)
                        + managed_policy_arns   = (known after apply)
                        + max_session_duration  = 3600
                        + name                  = "alert-to-slack"
                        + name_prefix           = (known after apply)
                        + path                  = "/"
                        + tags_all              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + unique_id             = (known after apply)

                        + inline_policy (known after apply)
                      }

                    # aws_sns_topic.ToSlack (ToSlack) will be created
                    + resource "aws_sns_topic" "ToSlack" {
                        + arn                         = (known after apply)
                        + beginning_archive_time      = (known after apply)
                        + content_based_deduplication = false
                        + fifo_topic                  = false
                        + id                          = (known after apply)
                        + name                        = "AlertToSlack"
                        + name_prefix                 = (known after apply)
                        + owner                       = (known after apply)
                        + policy                      = (known after apply)
                        + signature_version           = (known after apply)
                        + tags_all                    = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + tracing_config              = (known after apply)
                      }

                    # module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0] will be created
                    + resource "aws_cloudwatch_metric_alarm" "this" {
                        + actions_enabled                       = true
                        + alarm_actions                         = (known after apply)
                        + alarm_description                     = "This metric monitors Maximum CPUUtilization"
                        + alarm_name                            = "ec2_Maximum_alarm_CPUUtilization"
                        + arn                                   = (known after apply)
                        + comparison_operator                   = "GreaterThanThreshold"
                        + dimensions                            = {
                            + "InstanceId" = "i-XXXXXXXXXX"
                          }
                        + evaluate_low_sample_count_percentiles = (known after apply)
                        + evaluation_periods                    = 6
                        + id                                    = (known after apply)
                        + metric_name                           = "CPUUtilization"
                        + namespace                             = "AWS/EC2"
                        + period                                = 300
                        + statistic                             = "Maximum"
                        + tags_all                              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + threshold                             = 90
                        + treat_missing_data                    = "missing"
                      }

                  Plan: 4 to add, 0 to change, 0 to destroy.

                  ─────────────────────────────────────────────────────────────────────────────

                  Saved the plan to: plan

                  To perform exactly these actions, run the following command to apply:
                      terraform apply "plan"


```

</details>